class MessageText:
    fallbacks = "متوجه نشدم!"
    failure_instagram_username_update = "عملیات با شکست روبرو شد. ☹️\n" \
                                        "با عرض پوزش لطفا کمی بعد دوباره تلاش کنید."
    success_instagram_username_update = "آی دی اینستاگرام متصل به اکانت کلاب هوس شما با موفقیت بروزرسانی شد.😍🎉\n" \
                                        "شما اکنون می‌توانید وارد اپلیکشین کلاب هوس شده و به ادامه فعالیت خود بپردازید."
    start = "با سلام\n" \
            "به ربات کلاب هوس فارسی خوش اومدید. ☺️\n" \
            "گزینه مورد نظر خود را انتخاب کنید."
    about_us = "ما خیلی خوبیم 😜"
    enter_your_phone_number = "لطفا شماره تلفن همراه متصل به اکانت کلاب هوس خود را به همراه کد کشور وارد کنید.\n" \
                              "مثال: 989301234567+\n\n" \
                              "نکته: این روش هیچ هزینه‌ای ندارد فقط بعد " \
                              "از انجام عملیات اکانت ادمین این بات در کلاب هوس توسط شما فالو خواهد شد.\n"
    enter_your_instagram_username = "لطفا آیدی اکانت اینستاگرام خود را وارد کنید:\n" \
                                    "مثال یک: alidaei\n"
    enter_your_clubhouse_verification_code = "تا لحظاتی دیگر پیامکی حاوی یک رمز موقت به گوشی شما پیامک می‌شود.\n" \
                                             "لطفا آن را با دقت وارد کنید:\n" \
                                             "مثال یک: 8675\n"


class Keyboard:
    update_instagram_account = "تغییر یا افزودن اکانت اینستاگرام"
    about_us = "درباره ما"
